//# include <stdio.h>
//
//
//int main()
//
//{
//	//计算两个数的和
//	int num1, num2, sum; 
//	//C语言语法规定，变量要定义在当前代码块的最前面
//	//验证这种写法是OK的但为了逻辑清晰还是分布写比较好
//
//	//切记在 “输入中” 要用取地址符号“&”
//	printf("请输入第一个数:");
//	scanf_s("%d",&num1); //输出时一定要有取地址& //scanf 会报安全隐患建议 scanf_f
//	printf("请输入第二个数:");
//	scanf_s("%d",&num2); //输入%d后不要加\n 转义字符，容易计算失误
//	//printf("第一个数结果是%d\n第二个数结果是%d\n", num1, num2);
//	//scanf中不表示等待换行符，而是读取并放弃连续的空白字符,也就是说让scanf读到非空白字符为止 “容易出错不要尝试”
//	sum = num1 + num2;
//	printf("sum = %d", sum);
//
//
//	return 0;
//}









//int main()
//{
//	{
//		int a = 10;
//
//	
//	}
//	printf("%d",a); //不能编译局部变量，不在一个作用域里，局部变量的局限性
//	return 0;
//
//
//}





//int a = 20;
//
//int main()
//{
//	int a = 10; //局部变量和全局变量的名字建议不要相同-容易误会，产生bug
//				//当局部变量和全局变量的名字相同时，局部变量优先
//	printf("%d", a);
//	return 0;
//
//}
//



//int num2 = 20; //全局变量 - 定义在代码块{} 之外的变量
//
//int main()
//{
//
//	short age = 20;
//	char name = 'A'; // "" 双引号代表字符串，''单引号代表字符
//	float weight = 60.0f; //双精度的数，用单精度表示容易出错，所以在结尾添加个f 
//	float hight = 180.0f; //向内存申请4个字节，存放小数
//	printf("%d\n%c\n%lf\n%lf\n", age, name, weight, hight);
//
//	int num1 = 10;//局部变量-定义在代码块[]之内的变量
//
//	return(0);
//
//}